# coding=utf-8

import json

ll = []

input_data = "宫永伟,林俊颖,陆育帆,艾山江·艾尼,陈丽萍,汪俊杰,张宇鑫,邓枭,李婷,魏耀楣,卢远,王长欣,杨锦乾,巢成,蔡月啸,史鹏程,黄佳伟,丁翔,魏楚元,平明天,周文韬,刘雨薇,李许,金浩南,刘雯霞,魏晓晨,汪成,邹博士,岑申之,申一杨,朱振汉,孙巍然,李正喆,满煜璇,岳雨涵,冯雨舟,刘健,韦科,鹿欣磊,胡鑫,黄靖林,田晓杰,闫瑾,洪媛媛,地娜,李于敏,张欢子,杜姗姗,朱逸帆,陈阳,段仕伟,曾宇,孙涛,罗银,杨建辉,吴枫,李亮,张小杰,邹建宇,宋沈博,符维铨,索朗杰布,胡天豪,毕瑞峰,陈昊源,刘心怡,谢文群,李啸林,高梓豪,马凯,廖芸,邹孟雨,蒙邓颖,李静静,侯铖,伊木然·图尼亚孜,谷贤亮,杨天昱,葛俊锋,王振宇,陈明富,王宇轩,多吉,朱超逸,李斯祺,谷晨曦,祁开,刘楠,刘凌云,熊涛,顾陈智,邓干,普央吉,王锦江,赵旭阳,王成成,王若霖,保晓童,顾艺蒙,杨琨,王晶,石梦宁,唐翠甜,陈海杰,田欣,杨随鑫,周俊杰,陈燕啸,贾永超,贾亦真,陈宇,朱凯,熊冉,李嘉伟,李玉然,闫懋,茅涵俊,赵智健,沈攀,李浩然,杨子涵,汪旭,郑鑫磊,刘鸿彬,夏东宇,朱天齐,姚恬,朱亚男,付北京,潘柔臻,陈文静,黄丹怡,刘树生,曹智豪,朱建才,史陶磊,徐智尖,陈伟,沈鑫浩,李伟彦,陈佳瑶,潘婷,张洪浩,杜士伟,靖昊凯,金石开,杨葛,尚善飞,胡丞赫,林园,周首君,董余,娄议丹,蒋林志,雷仕洁,邓梓君,梁爽,宋旸,郭竹梅,杨雅茗,孙甜甜,黄梦诗,王国艳,戴士博,文俊,刘新光,孙广稷,陈翊,孟铮,李惠三,李易乾,翁睿,张乐扬,张家祺,杨杰,马鹏程,冯进,王梦瑶,王文婧,李雨桐,杨倩文,向冰心,张逸茹,张竞予,张佳琪,王辉,王子轩,吕佳耕,王博岩,欧阳坤宇,陈晨,易谦,冉聪,郭珍蒙,赵力锐,邵小彤,徐静怡,郭佳欣,王良庆,李淼儿,李鑫杰,朱智鹏,张仕举,曾进濠,王楷,蔚玥,付千荣,方建军,彭德禄,白嘉麒,杨晓鹏,钱慧萍,蔡咏薇,叶茜,陈佳蓉,魏泽琳,李守一,高骁,曾毓秀,杨轲,李振维,俞瑜,郑璐,高阳,奚航,陈庆祥,郭博文,邱泽浩,熊凯,耿文亮,胡春林,王嘉诚,黄子文,胡孟孟,姜丹妮,李科,叶竹静,吕柏青,胡凌晨,朱泓玮,晏临风,徐宇顺,周祥,贺银香,陈冠余,夏桐峰,谢天,潘绍蔚,费振环,李朝晖,施京海,徐昆,潘贵,郑颖,刘殊含,田慧,刘培,倪苏婕,伦艳茹,赵雨亭,燕昕新,涂俊峰,窦瑞璞,方雨麒,羊绍禹,李宇涵,郭宁,雷扬,邹冠沄,郭东峰,汤茂哥,刘家兴,李兴峻,李加陆,刘彦哲,刘国坤,卞东,杨玑帆,杨思睿,张勤晨,柯卓琳,马逸欣,钱嘉欣,冷端杰,蔡忠源,王奇超,曹伟思,叶童,曹汉成,龙睿涵,赵诗奇,郭志强,李羿霏,俞天允,肖应民,徐沐雨,李梦晗,崔海达,任艳杰,王梦伟,张敩,莫永浩,张福升,李大伦,常为,叶丹,朱婷,赵泽华,严新宇,修立琨,徐新航,汤国铄,代俊陶,王康星,吴扬俊,武起龙,吴靖夫,高伟伦,刘骏,荆顺吉,沈豪,韦立演,张峥,周鑫钟,杨柏桐,崔永智,骆羿,杨逸轩,沈嘉豪,曹晓国,黄斯胤,刘志赞,李双玖,马淳勖,李舒航,李瀚哲,晋子康,祁世成,肖曦,韩镕泽,吴晓雪,张馨丹,殷梓轩,文宝,范宇,朱隆熙,郑贺,潘羽习,何文奎,辛若兰,吉哲瑶,盛诗雨,黄宇颖,李昌蔚,霍艳池,宗辰辰,陈海璇,邵奕夫,覃思远,刘燚,王帆,郭洪涛,张庄昱,马金石,肖洵萁,胡易航,罗培博,孔凡豪,黄一健,景海鲲,彭钦,杨涛,郑育梁,章旭,闫宸翊,马子涵,丁玥,武文轩,来泽晨,刘佳美,吴梦帆,刘一辰,韩睿,曾宪迪,孙志豪,施子豪,蔡旭辰,龙世章,王林,秦启桐,王琦,赵淳葛,何佳泽,翟毅博,高远,陆晨,刘丛恺,陈炯袤,孙阳,龙浩,邢临川,王欣,杨裕馨,周佳丽,秦驰,方梓威,黄滕辉,双明畅,傅桂丹,袁淑芬,许根文,任军铭,何育豪,黄有志,秦毓泽,吴光宇,郑荏书,徐英杰,李宇凡,黄智彬,王一航,潘霆钧,杨博奡,邱嘉祺,李世煜,甘长帆,张健,陈倩仪,张可盈"

input_ll = input_data.split(",")

for index, item in enumerate(input_ll):
    data = {
        "phone": str(index) + "号",
        "name": item
    }
    ll.append(data)

re_file = open("result.txt", "w", encoding="utf-8")
re_file.write(str(ll))
re_file.close()